using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp18
{
    internal class Program
    {
        static void Main(string[] args)
        {

            /*
                                                              
                                                                              for loop  
                               فور لوپ بەکاردێت بو دووبارەکردنەوەی چەندجارەی کارێک یان فرمانێک 
                              با رونتر بکەمەوە بوت , نموونە دەتوێت دەجار بنوسرێت من پروگرامسازم
                              ئەگەر فورلوپ بەکارنەهێنیت دەبێت دەجار بنوسی کونسول من پروگرامسازم
          بەس فورلوپ ئەم کارەی بو ئاسنکردوین  بە ئەنجامدانی چەند تەکنیکێکی کورت تا بەئەنجام بگەین 
          


               for (Initializer ;TestExpr ;IterationExper)
               {
                        statement ;
               }



                initializer
                  i ئەو بەشەیە کە یێکەمجار جێبەجێ دەبێت . وە زوربەی کات ڤەریبلەکە بە
                                          تەعریف دەکرێت شتێکی نورمالە کە ناوی بگوری
            . 
                TestExpr
                دوای ئەوەی کە ڤەریبلەکەت تەعریف کرد بە ئای دەچێتە قوناغی دووەم کە تێست ئێکسپر
                                                        .کە لەوێشدا مەرج دادەنرێت واتە کوندیشن 


                 دوای ئەوە راستەوخوو دەچێتە بەشی ستێتمێنت ئەگەر هاتوو مەرجەکەی راست بوو 
                                 . وە ستێتمێنتەکە رەن دەبێت جا هەر کردارێکت تیا نوسیبێت

                IterationExper
                     دوای ئەوە دیسان دەگەرێتەوە سەرەوە وە بەشی یترەیشن ئێکسپێر رەن دەبێت
                                 لەوێش هەر شتێک نوسیبێتت بوو کرداری زیادکردن یان کەمرکردن
                     یان هەر کردارێکی هزری بو ئەنجامدانی کارەکەت وە زوربەی کات پلەس پلەسە


             
                         وە کە  بەشی یترەیشن ئێکسپێر دەرچوو دیسان دەچێتەوە بەشی تێست ئێکسپێر 
               وە گەر هاتوو مەرجەکە راست بوو دیسان دێتەوه خوارەوە وە ستێتمێنتەکە رەن دەبێتەوە 
                      واتە بەکورتی . راست بونی مەرج ، رەن بونی ستێتمێنت ، کرداری هزری ، دیسان 
                             راست بوونی مەرج رەن بوونی ستێتمێنت ، کرداری هزری ، بەم شێوازە هەر
                               بەردەوام دەبێت تاوەکوو مەرجەکە هەلە دەبێت .وە لوپەکە دەوەستێت 

             */





            /*
            
                          لەم نموونەیەدا فورلوپ لە ئای دەست پێدەکات کە یێکسانە بە سفر وە ئێمە مامەلە لەگەل سفر دەکەین لەرێگەێ ئای
                       مەرجێکمان هەیە دەچێتە ناوی دەلێین ئای بچوکترە لە پێنج واتە سفر بچوکترە لە پێنج بەلێ کەوتە دێتە خوارەوە وە ئای رەن دەبێت کە ژمارە سفرە 
                      دیسان دەچێتەوە سەرەوە وە ئای زیاددەبێت یێک ژمارە دەبتە یێک ، وە دیسان دەچێتە نێو مەرجەکە یێک بچوکترە لە پێنج ، بەلێ کەواتە ئای دیسان رەن 
          دەبێتەوە کە ژمارە یێکە . ینجا هەر ئاوا بەردەوام دەبێت تا ئای دەبێتە ژمارە پێنج وە دەچێته نێو مەرجەکە دەلێین ئایا پێنج بچوکترە لە پێنج نەخێر کەوتە مەرجەکە دەوەستێت
             
             */

            for (int i = 0; i < 5; i++)
            {
                Console.WriteLine(i);
            }







            /*
                                           لێرە ئای لە ژمارە دە دەست پێدەکات وە تاوەکوو ژمارە بیست دەروات 
            وە لێرەدا وشەی ورایت لاینمان نەنوسیوە تەنها نوسیتم ورایت کەواتە بە شێوازی لاین درێژ پێشانم دەدات 
                                   وە لێرە سلاش تی بەواتای تاب یان پێدانی چوار سپەیس دێت لەناوبەینی ژمارەکان
              
             */


            for (int i = 10; i <20 ; i++)
            {
                Console.Write(i +"\t ");
            }


          




        }
    }
}
