using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp15
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /*     
                                                             If Statement
                          بلوک کودێکە بەکاردێت بو دانانی مەرج بۆ داتاکان 
                              نموونە دەتەوێت بچیت بۆ بازار وتومبێل بکریت   
         دەلێیت ئەگەر وتومبێلەکە سپی بێت دەمەوێت ئەگەر سپی نەبوو نامەوێت 
             If ئەو ئەگەرەی نوسراوە لەسەرەتادا لەکود چنیندا دەتوانرێت بە  
                      بنوسرێت بە دانانی کومەلێک مەرج یان بارووخ لەنێویدا






            شێوازی سادەی دەربرینی 


            if (  یان مەرج condition  )
            {
                  ئەگەر مەرجەکە راست بوو ئەو شتەی لێرە دەنوسرێ جا تێکست بێت 
                  یان حساباتێکی بیرکاری بێت یان هەر شتێک کە دەتەوێت جێبەجێ بێت
                  لەکاتی راست بونی مەرجەکە وە بەو ناوەندە دەوترێ بلوک کود 
            }
            */

            // X = y لێرەدا کوتومانە ئەگەر ئەو ژمارەیەی نێو ئێکس یێکسانبێت بەو ژمارەیەی وای با بنوسرێت
      
            int x = 10;
            int y = 10;
            if (x == y)
            {
                Console.WriteLine("x=y");
            }



            //ئەگەر ئەی گەورەتربێت لە بی  بنوسە ئەی گەورەترە لە بی بەس لێرە ئەی دوازدەیە وە بی سیانزەیە
                                  //بویە مەرجەکە جێبەجێ نابێت وە دەچێتە دەرەوە وە بلوک کودەکە رەن نابێت 
            int a = 12;
            int b = 13;


            //ئەگەر ئەی بچوکتربێت لە بی  بنوسە ئەی بچوکترە لە بی  لێرەدا ئەی دوازدەیە وە بی سیانزەیە
                                                  //بویە مەرجەکە جێبەجێ دەبێت چونکە ئەی بچوکترە لە بی
            if (a< b)
            {
                Console.WriteLine("a < b ");
            }


            if (a <= b)
            {
                Console.WriteLine(" a <= b ");
            }
            if (a>b)
            {
                Console.WriteLine("a > b");
            }
           

            if (a != b)
            {
                Console.WriteLine("a != b");
            }

            if (a != b)
            {
                Console.WriteLine(a + b);
            }

            if (10 > 9)
            {
                Console.WriteLine(9*10);
            }
        }
    }
}

