using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp19
{
    internal class Program
    {
        static void Main(string[] args)
        {
            /* While loop

         وایل لووپ وەکو فور لووپ بەکاردێت بو کەمکردنەوەی کود وە ئەنجامدانی کردارێک بە کاتێکی کەم 
                        تو ئازادیت کام بەشە بەکاردێنی بەپێی جوری کارەکەت 
                             هەندێک کار فور لوپ ئاسانترە بەکارهێنانی 
                          وە هەندێک کار وایەل لوپ ئاسانترە بەکارهێنانی 


            while (textExpr)
            {
            //stetment
            }
             */


            /*
                                       ئەگەر بە دیقەتەوە سەیری ئەم  نموونەیە       
            سەرەتا ئێکس دەناسێنین وە یێکسانی دەکەین بە ژمارە سفر وە ئێکس لە سفرەوە دەست پێدەکات     
                  دواتر دەلێین ئەگەر ئێکس واتە سفر بچوکتر بوو لە دە . ئەوا ژمارە سفرو بنوسە  
            دواتر کە ژمارە سفرت نوسی یێک دانە بو ژمارە سفر زیاد بکە وە بگەرێوە سەرەوە بو نێو کەوانەی 
                              وایەلەکە وە بلێ ئایە یێک بچوکترە لە دە بەلێ کەواتە رەنی بکە
             بەم شێوازە بەردەوام دەبێ تا دەگاتە ژمارە دە وە دە بچوکتر نیە لە دە بویە تا ژمارە نوو رەن دەبێت لە ئاوتپود
            */


            int x = 0;
            while (x < 10)
            {

                Console.WriteLine(x);
            
            }


            /*
                      زمانی سێ شارپ لاین لاین دێتە خوارێ وە کود رەن دەبێ 
                           بویە ئەگەر ئێکس لە سەروی ستێتمێنتەکە بوایە
            سەرەتا دانەیەک بو ئێکس زیاد دەبوو کە سفر دەبێتە یێک ئەوجا ستێتمێنتەکە رەن دەبوو

                       وە ئەگەر ئێمە پلاس پلاسمان بوو ئێکس زیاد نەکردبا 
            ئەوا تا هەتایە ژمارە سفر دەرەچوو چونکە هەمیشە مەرجەکە راست دەرەچێ
                    وە هەر دەگەرێتەوە سەرەوە سفر بچوکترە لە سەت، رەنبە 
                   سفر بچوکترە لە سەت  ،رەنبە , هەتا هەتایە هەر سفر دەرەچوو 


            */

        }
    }
}
